In [1]:
import pandas as pd

In [2]:
numbers = [1, 2, 3, 4, 5, 6]

In [3]:
pd.DataFrame(numbers)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [4]:
data = [["Jhon", 23], ["Mary", 18], ["Jhon", 31]]

In [5]:
pd.DataFrame(data)

      0   1
0  Jhon  23
1  Mary  18
2  Jhon  31

In [7]:
pd.DataFrame(data, columns = ["name", "age"])

   name  age
0  Jhon   23
1  Mary   18
2  Jhon   31

In [8]:
pd.DataFrame(data, columns = ["name", "age"], index = ["id1", "id2", "id3"])

     name  age
id1  Jhon   23
id2  Mary   18
id3  Jhon   31